In [1]:
import pandas as pd

#### ex_row_col

- DataFrame에서 데이터 추출
    - 열(컬럼 column 세로벡터) 단위 데이터 추출  
        - df[ '컬럼 명' ]
        - df.'컬럼 명'  
        
        
    - 행(로우 row 가로 벡터) 단위 데이터 추출
        - df.loc[ '인덱스 라벨' ]
        - df.iloc[ index ]  
        
        
    - 원소 단위 데이터 추출
        - df.loc[ '행 인덱스 라벨', '열 인덱스 라벨' ]
        - df.iloc[ row index, col index ]
        
        - df[ '컬럼 명' ][ index ]

In [5]:
# DF 객체 생성
df = pd.DataFrame([[1,2,3], [11,22,33]])

# DF 객체 요약 정보
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [6]:
# DF 객체 구성 확인
df

    0   1   2
0   1   2   3
1  11  22  33

In [7]:
df[1]

0     2
1    22
Name: 1, dtype: int64

In [8]:
df.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [9]:
df.iloc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [12]:
df.loc[0:1]

    0   1   2
0   1   2   3
1  11  22  33

In [11]:
df.iloc[0:2]

    0   1   2
0   1   2   3
1  11  22  33

In [13]:
df[[0,2]]

    0   2
0   1   3
1  11  33

In [18]:
df.columns = ['하나', '둘', '셋']
df.index = ['영', '일']
df

   하나   둘   셋
영   1   2   3
일  11  22  33

In [21]:
df.loc['영']

하나    1
둘     2
셋     3
Name: 영, dtype: int64

In [22]:
df.loc['일':]

   하나   둘   셋
일  11  22  33

In [23]:
df.iloc[1:]

   하나   둘   셋
일  11  22  33

In [25]:
df.loc[1]

KeyError: 1

In [26]:
df.T

    영   일
하나  1  11
둘   2  22
셋   3  33

In [29]:
exam_data = {'수학': [90,90,90], '영어': [100,50,90], '음악': [40,60,80], '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
df

    수학   영어  음악   체육
서준  90  100  40  100
우현  90   50  60   90
인아  90   90  80   90

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes

In [33]:
df.shape

(3, 4)

In [35]:
df.loc[['우현']]

    수학  영어  음악  체육
우현  90  50  60  90

In [36]:
df.iloc[[0,2]]

    수학   영어  음악   체육
서준  90  100  40  100
인아  90   90  80   90

In [37]:
df['음악']

서준    40
우현    60
인아    80
Name: 음악, dtype: int64

In [44]:
df.loc[['우현'],['음악']]

    음악
우현  60

In [45]:
type(df.loc[['우현'],['음악']])

pandas.core.frame.DataFrame

In [51]:
df['영어'][0]

100

In [40]:
df.sort_index(ascending=False)

    수학   영어  음악   체육
인아  90   90  80   90
우현  90   50  60   90
서준  90  100  40  100

In [52]:
df.loc['지현'] = [100, 100, 100, 100]
df

     수학   영어   음악   체육
서준   90  100   40  100
우현   90   50   60   90
인아   90   90   80   90
지현  100  100  100  100

In [53]:
df['과학'] = [80, 60, 40, 100]
df

     수학   영어   음악   체육   과학
서준   90  100   40  100   80
우현   90   50   60   90   60
인아   90   90   80   90   40
지현  100  100  100  100  100

In [54]:
df.loc['혜주'] = 100
df

     수학   영어   음악   체육   과학
서준   90  100   40  100   80
우현   90   50   60   90   60
인아   90   90   80   90   40
지현  100  100  100  100  100
혜주  100  100  100  100  100

##### DF에서 행, 열 삭제
- df.drop('행 이름')
- df.drop('열 이름', axis =1)

    
    - 실제 데이터에서 삭제하지 않음 > 삭제한 복사본 반환
    - inplace = True : 실제 데이터 변경

In [57]:
df.drop('인아', inplace = True)

In [59]:
df.drop('음악', axis = 1, inplace = True)

In [60]:
df

     수학   영어   체육   과학
서준   90  100  100   80
우현   90   50   90   60
지현  100  100  100  100
혜주  100  100  100  100

     수학   영어   체육   과학
서준   90  100  100   80
우현   90   50   90   60
지현  100  100  100  100
혜주  100  100  100  100

In [69]:
for i, x in df.iterrows():
    print(i,'\n', x,'\n')
    
for i, x in enumerate(df):
    print(i, x)

서준
 수학     90
영어    100
체육    100
과학     80
Name: 서준, dtype: int64

우현
 수학    90
영어    50
체육    90
과학    60
Name: 우현, dtype: int64

지현
 수학    100
영어    100
체육    100
과학    100
Name: 지현, dtype: int64

혜주
 수학    100
영어    100
체육    100
과학    100
Name: 혜주, dtype: int64

0 수학
1 영어
2 체육
3 과학

In [72]:
# 행 열 전환
print(df.transpose())
print(df.T)

     서준  우현   지현   혜주
수학   90  90  100  100
영어  100  50  100  100
체육  100  90  100  100
과학   80  60  100  100
     서준  우현   지현   혜주
수학   90  90  100  100
영어  100  50  100  100
체육  100  90  100  100
과학   80  60  100  100

#### Index 다루기
- 인덱스 일부 변경
- 특정 컬럼을 인덱스로 설정
- 기존 인덱스에 추가
- 인덱스를 column으로 (0-base 인덱스로 리셋)

In [10]:

import pandas as pd

data = {'이름' : [ '서준', '우현', '인아'],
        '수학' : [ 90, 80, 70],
        '영어' : [ 98, 89, 95],
        '음악' : [ 85, 95, 100],
        '체육' : [ 100, 90, 90]}

df = pd.DataFrame(data)
# df.set_index('이름', inplace = True)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [15]:
# DF의 속성 읽기 > index, columns, shape
print(f'index : {df.index.values}')
print(f'columns : {df.columns.values}')
print(f'shape : {df.shape}')

print(f'info : {df.info()}')

index : [0 1 2]
columns : ['이름' '수학' '영어' '음악' '체육']
shape : (3, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes
info : None

In [16]:
# 특정 컬럼을 인덱스 설정 > 중복, null 없어야한다 > 멀티 인덱스

df.set_index('이름')

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [19]:
df.set_index(['이름', '수학'], inplace= True)

In [22]:
# 인덱스 초기화(리셋)
# - 기존 인덱스는 컬럼으로 추가

df.reset_index(inplace = True)

In [23]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [40]:
df.loc[3] = ['서준', 89, 34,25,90]

df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3  서준  89  34   25   90

In [27]:

df.set_index('이름').loc['서준']

    수학  영어  음악   체육
이름
서준  90  98  85  100
서준  89  34  25   90

In [28]:
df.set_index(['이름', '음악'])

        수학  영어   체육
이름 음악
서준 85   90  98  100
우현 95   80  89   90
인아 100  70  95   90
서준 25   89  34   90

In [31]:
#  인덱스 재배열
# - 기존 인덱스 순서 변경
# - inplace
df.reindex([2,3,1,0])

   이름  수학  영어   음악   체육
2  인아  70  95  100   90
3  서준  89  34   25   90
1  우현  80  89   95   90
0  서준  90  98   85  100

In [32]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3  서준  89  34   25   90

In [51]:
# index 하나씩 바꾸기
# - 기존 인덱스/ 컬럼에서 일부분 변경하는 메서드
# - DF객체 변수명.rename(index = {}, columns = {})
df.rename(columns = {'수학': 'math', '음악': 'music'})

    math  영어  music   체육
이름
서준    90  98     85  100
우현    80  89     95   90
인아    70  95    100   90
서준    89  34     25   90

ctrl 누르고 여러 곳 클릭하면 한번에 입력 가능

#### Series 연산

- Series 객체의 모든 원소에 숫자 연산 적용 > 브로드캐스팅

In [55]:
import pandas as pd

sr = pd.Series([10,20,30,40])
sr

0    10
1    20
2    30
3    40
dtype: int64

In [58]:
# 숫자 데이터와 연산 수행
result = sr + 5
print(f'result : \n{result} \nresult type : {type(result)}')

result :
0    15
1    25
2    35
3    45
dtype: int64
result type : <class 'pandas.core.series.Series'>

In [59]:
# 시리즈와 시리즈 연산 수행
result = sr + sr
print(f'result : \n{result} \nresult type : {type(result)}')

result :
0    20
1    40
2    60
3    80
dtype: int64
result type : <class 'pandas.core.series.Series'>

In [60]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
student1 +student2

국어    190
수학    170
영어    160
dtype: int64

In [66]:
student1 * student2

국어    9000
수학    7200
영어    6400
dtype: int64

In [64]:
student1.dot(student2)

22600

In [68]:
# 동일 인덱스가 없는 경우 연산 수행 안함
student3 = pd.Series({'수학':80, '국어':90})
student1 + student3

국어    190.0
수학    170.0
영어      NaN
dtype: float64

In [73]:
print(student1.add(student3, fill_value = '0'))
print(student1.mul(student3, fill_value = '0'))
print(student1.div(student3, fill_value = '0'))

국어    190.0
수학    170.0
영어     80.0
dtype: float64
국어    9000.0
수학    7200.0
영어       0.0
dtype: float64
국어    1.111111
수학    1.125000
영어         inf
dtype: float64

In [79]:
df = df.drop('서준')

#### Bollean Indexing

- Series/ DataFrame 객체에서 빠르게 원하는 원소를 추출
- Series/ DataFrame 객체의 원소에 연산 결과 가 t / f

In [91]:
df = pd.DataFrame({'name': ['park', 'kim', 'lee'], 
                  'age' : [10,21,16],
                  'gende' : ['f','f','m']})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gende   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [92]:
df

   name  age gende
0  park   10     f
1   kim   21     f
2   lee   16     m

In [94]:
# age 컬럼 + 비교연산 >> 나이가 15세 이상

df[['age']]>=15

     age
0  False
1   True
2   True

In [114]:
df['age'][[False, True, True]]

1    21
2    16
Name: age, dtype: int64

In [102]:
df['age'][df['age']>=15]

1    21
2    16
Name: age, dtype: int64

In [115]:
df[df['age']>15]

  name  age gende
1  kim   21     f
2  lee   16     m

In [117]:
# 성별이 남자
df[df.gende == 'm']

  name  age gende
2  lee   16     m

In [118]:
# 15세 이상 남자
df[(df.age >= 15 ) * (df.gende == 'm')]

  name  age gende
2  lee   16     m

In [120]:
(df.age >= 15 )

0    False
1     True
2     True
Name: age, dtype: bool

In [124]:
df[(df.age >= 15 ) * (df.gende == 'm')]

  name  age gende
2  lee   16     m

In [123]:
df[(df.age >= 15 ) & (df.gende == 'm')]

  name  age gende
2  lee   16     m

In [130]:
pd.Series([1, 0,1,0,1,0])&pd.Series([1,1,0,0,1])

0     True
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [131]:
([1, 0,1,0,1,0]) and ([1,1,0,0,1])

[1, 1, 0, 0, 1]

In [139]:
True and False

False

In [138]:
[(df['age'] >= 15 ) & (df['gende'] == 'm')]

[0    False
 1    False
 2     True
 dtype: bool]

#### 파일 처리
- 다양한 종류의 파일을 DataFrame읽기
- pandas.read__000('경로', options)
- pandas.read_csv('경로', header, index_col, names

In [144]:
import pandas as pd
DIR_PATH = '../Data/'
FILE_NAME = DIR_PATH + 'iris.csv'

In [145]:
iris = pd.read_csv(FILE_NAME)
iris

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

In [146]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SepalLength  150 non-null    float64
 1   SepalWidth   150 non-null    float64
 2   PetalLength  150 non-null    float64
 3   PetalWidth   150 non-null    float64
 4   Name         150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [148]:
iris.shape

(150, 5)

In [157]:
def print_detail(data):
    print(f'''
--- data detail ----------

shape : {data.shape}
columns :
{data.columns.values}

index : 
{data.index}


{data.info}
''')

In [158]:
print_detail(iris)

          --- data detail ----------

shape : (150, 5)
columns :
['SepalLength' 'SepalWidth' 'PetalLength' 'PetalWidth' 'Name']

index :
RangeIndex(start=0, stop=150, step=1)


<bound method DataFrame.info of      SepalLength  SepalWidth  PetalLength  PetalWidth            Name
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]>

In [161]:
iris.head(10)

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa
5          5.4         3.9          1.7         0.4  Iris-setosa
6          4.6         3.4          1.4         0.3  Iris-setosa
7          5.0         3.4          1.5         0.2  Iris-setosa
8          4.4         2.9          1.4         0.2  Iris-setosa
9          4.9         3.1          1.5         0.1  Iris-setosa

In [162]:
iris.tail(3)

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

In [165]:
['Length'in col for col in iris.columns]

[True, False, True, False, False]

In [175]:
iris.Name.value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Name, dtype: int64

In [167]:
iris[iris.Name == 'Iris-setosa']

    SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0           5.1         3.5          1.4         0.2  Iris-setosa
1           4.9         3.0          1.4         0.2  Iris-setosa
2           4.7         3.2          1.3         0.2  Iris-setosa
3           4.6         3.1          1.5         0.2  Iris-setosa
4           5.0         3.6          1.4         0.2  Iris-setosa
5           5.4         3.9          1.7         0.4  Iris-setosa
6           4.6         3.4          1.4         0.3  Iris-setosa
7           5.0         3.4          1.5         0.2  Iris-setosa
8           4.4         2.9          1.4         0.2  Iris-setosa
9           4.9         3.1          1.5         0.1  Iris-setosa
10          5.4         3.7          1.5         0.2  Iris-setosa
11          4.8         3.4          1.6         0.2  Iris-setosa
12          4.8         3.0          1.4         0.1  Iris-setosa
13          4.3         3.0          1.1         0.1  Iris-setosa
14          5.8         4.0          1.2         0.2  Iris-setosa
15          5.7         4.4          1.5         0.4  Iris-setosa
16          5.4         3.9          1.3         0.4  Iris-setosa
17          5.1         3.5          1.4         0.3  Iris-setosa
18          5.7         3.8          1.7         0.3  Iris-setosa
19          5.1         3.8          1.5         0.3  Iris-setosa
20          5.4         3.4          1.7         0.2  Iris-setosa
21          5.1         3.7          1.5         0.4  Iris-setosa
22          4.6         3.6          1.0         0.2  Iris-setosa
23          5.1         3.3          1.7         0.5  Iris-setosa
24          4.8         3.4          1.9         0.2  Iris-setosa
25          5.0         3.0          1.6         0.2  Iris-setosa
26          5.0         3.4          1.6         0.4  Iris-setosa
27          5.2         3.5          1.5         0.2  Iris-setosa
28          5.2         3.4          1.4         0.2  Iris-setosa
29          4.7         3.2          1.6         0.2  Iris-setosa
30          4.8         3.1          1.6         0.2  Iris-setosa
31          5.4         3.4          1.5         0.4  Iris-setosa
32          5.2         4.1          1.5         0.1  Iris-setosa
33          5.5         4.2          1.4         0.2  Iris-setosa
34          4.9         3.1          1.5         0.1  Iris-setosa
35          5.0         3.2          1.2         0.2  Iris-setosa
36          5.5         3.5          1.3         0.2  Iris-setosa
37          4.9         3.1          1.5         0.1  Iris-setosa
38          4.4         3.0          1.3         0.2  Iris-setosa
39          5.1         3.4          1.5         0.2  Iris-setosa
40          5.0         3.5          1.3         0.3  Iris-setosa
41          4.5         2.3          1.3         0.3  Iris-setosa
42          4.4         3.2          1.3         0.2  Iris-setosa
43          5.0         3.5          1.6         0.6  Iris-setosa
44          5.1         3.8          1.9         0.4  Iris-setosa
45          4.8         3.0          1.4         0.3  Iris-setosa
46          5.1         3.8          1.6         0.2  Iris-setosa
47          4.6         3.2          1.4         0.2  Iris-setosa
48          5.3         3.7          1.5         0.2  Iris-setosa
49          5.0         3.3          1.4         0.2  Iris-setosa

In [178]:
iris.isnull().sum()

SepalLength    0
SepalWidth     0
PetalLength    0
PetalWidth     0
Name           0
dtype: int64

In [182]:
# 기술통계 정보 보기
iris.describe()

       SepalLength  SepalWidth  PetalLength  PetalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.054000     3.758667    1.198667
std       0.828066    0.433594     1.764420    0.763161
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [183]:
iris.describe(include = 'all')

        SepalLength  SepalWidth  PetalLength  PetalWidth         Name
count    150.000000  150.000000   150.000000  150.000000          150
unique          NaN         NaN          NaN         NaN            3
top             NaN         NaN          NaN         NaN  Iris-setosa
freq            NaN         NaN          NaN         NaN           50
mean       5.843333    3.054000     3.758667    1.198667          NaN
std        0.828066    0.433594     1.764420    0.763161          NaN
min        4.300000    2.000000     1.000000    0.100000          NaN
25%        5.100000    2.800000     1.600000    0.300000          NaN
50%        5.800000    3.000000     4.350000    1.300000          NaN
75%        6.400000    3.300000     5.100000    1.800000          NaN
max        7.900000    4.400000     6.900000    2.500000          NaN